In [1]:
import pandas as pd

In [13]:
var10=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[11,12,13,14,15]})
var10

   A  B   C
0  1  9  11
1  2  8  12
2  3  7  13
3  4  6  14
4  5  5  15

# INSERT

In [11]:
var10.insert(1,"c",var10["A"])
var10

   A  c  java
0  1  1     1
1  2  2     2
2  3  3     3
3  4  4     4
4  5  5     5

In [7]:
# var10.insert(1,"python", [11,12,13,14,15])
var10

   A  java  B
0  1     1  9
1  2     2  8
2  3     3  7
3  4     4  6
4  5     5  5

# DELETE

In [14]:
var10.pop("B")
var10

   A   C
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [17]:
var1=var10.pop("C")
var1

0    11
1    12
2    13
3    14
4    15
Name: C, dtype: int64